-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/statalogs/repeat_checks_hhid.log
  log type:  text
 opened on:  19 Jul 2021, 16:53:46

. 
. * IMPORT DATA================================================================
> =*/ 
. import delimited `c(pwd)'/output/input.csv, clear
(10 vars, 22,017,237 obs)

. 
. * RAW DATA DESCRIPTION=======================================================
> =*/ 
. 
. desc

Contains data
  obs:    22,017,237                          
 vars:            10                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
patient_id      long    %8.0g                 
household_id    long    %12.0g                
household_size  int     %8.0g                 
mixed_household byte    %8.0g                 
percent_tpp     byte    %8.0g                 
msoa            str9    %9s                   
rural_urban     byte    %8.0g                 
imd             long    %12.0g                
age             int     %8.0g                 
care_home_type  str2    %9s                   
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. summarize household_id, d 

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,017,237
25%      1303754              0       Sum of Wgt.    22017237

50%      4092970                      Mean            4186696
                        Largest       Std. Dev.       3077401
75%      6824912        9805608
90%      8570172        9805608       Variance       9.47e+12
95%      9180759        9805609       Skewness       .1378113
99%      9689692        9805609       Kurtosis       1.738103

. summarize household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,017,237
25%            1              0       Sum of Wgt.    22017237

50%            2                      Mean           4.469126
                        Largest       Std. Dev.      42.40944
75%            4           2588
90%            5           2588       Variance       1798.561
95%            7           2588       Skewness       36.35616
99%           12           2588       Kurtosis       1662.018

. summarize percent_tpp, d

                         percent_tpp
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,017,237
25%           90              0       Sum of Wgt.    22017237

50%          100                      Mean            82.3975
                        Largest       Std. Dev.      34.96904
75%          100            100
90%          100            100       Variance       1222.834
95%          100            100       Skewness      -1.745368
99%          100            100       Kurtosis       4.306631

. summarize age, d

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              0
 5%            5              1
10%            9              1       Obs          22,017,237
25%           23              1       Sum of Wgt.    22017237

50%           42                      Mean           41.82572
                        Largest       Std. Dev.      23.33631
75%           60            120
90%           73            120       Variance       544.5835
95%           80            120       Skewness       .0790763
99%           89            121       Kurtosis       2.042777

. 
. tab mixed_household, m

mixed_house |
       hold |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 19,325,437       87.77       87.77
          1 |  2,691,800       12.23      100.00
------------+-----------------------------------
      Total | 22,017,237      100.00

. tab rural_urban, m  

rural_urban |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |    193,117        0.88        0.88
          0 |    195,391        0.89        1.76
          1 |  4,453,959       20.23       21.99
          2 |  1,386,753        6.30       28.29
          3 | 11,366,123       51.62       79.92
          4 |     34,829        0.16       80.07
          5 |  2,411,810       10.95       91.03
          6 |    102,533        0.47       91.49
          7 |  1,743,405        7.92       99.41
          8 |    129,317        0.59      100.00
------------+-----------------------------------
      Total | 22,017,237      100.00

. tab care_home_type, m

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
            |    195,391        0.89        0.89
         PC |     42,205        0.19        1.08
         PN |     34,445        0.16        1.24
         PS |      1,868        0.01        1.24
          U | 21,743,328       98.76      100.00
------------+-----------------------------------
      Total | 22,017,237      100.00

. tab imd, m 

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |    193,403        0.88        0.88
          0 |    219,224        1.00        1.87
        100 |     56,298        0.26        2.13
        200 |     63,636        0.29        2.42
        300 |     76,751        0.35        2.77
        400 |     65,272        0.30        3.06
        500 |     52,857        0.24        3.30
        600 |     72,605        0.33        3.63
        700 |     70,942        0.32        3.96
        800 |     68,050        0.31        4.27
        900 |     72,977        0.33        4.60
       1000 |     67,977        0.31        4.91
       1100 |     72,582        0.33        5.23
       1200 |     77,038        0.35        5.58
       1300 |     66,955        0.30        5.89
       1400 |     68,848        0.31        6.20
       1500 |     79,556        0.36        6.56
       1600 |     65,518        0.30        6.86
       1700 |     79,907        0.36        7.22
       1800 |     65,498        0.30        7.52
       1900 |     75,962        0.35        7.87
       2000 |     65,190        0.30        8.16
       2100 |     68,901        0.31        8.47
       2200 |     63,437        0.29        8.76
       2300 |     77,330        0.35        9.11
       2400 |     66,614        0.30        9.42
       2500 |     74,281        0.34        9.75
       2600 |     68,291        0.31       10.06
       2700 |     62,432        0.28       10.35
       2800 |     80,233        0.36       10.71
       2900 |     91,426        0.42       11.13
       3000 |     78,224        0.36       11.48
       3100 |     60,966        0.28       11.76
       3200 |     67,616        0.31       12.07
       3300 |     74,015        0.34       12.40
       3400 |     58,417        0.27       12.67
       3500 |     67,772        0.31       12.98
       3600 |     58,405        0.27       13.24
       3700 |     69,065        0.31       13.56
       3800 |     62,953        0.29       13.84
       3900 |     66,429        0.30       14.14
       4000 |     61,363        0.28       14.42
       4100 |     70,874        0.32       14.74
       4200 |     69,491        0.32       15.06
       4300 |     59,376        0.27       15.33
       4400 |     64,247        0.29       15.62
       4500 |     67,739        0.31       15.93
       4600 |     56,013        0.25       16.18
       4700 |     69,538        0.32       16.50
       4800 |     50,077        0.23       16.73
       4900 |     72,024        0.33       17.05
       5000 |     70,913        0.32       17.38
       5100 |     61,745        0.28       17.66
       5200 |     75,063        0.34       18.00
       5300 |     66,507        0.30       18.30
       5400 |     77,935        0.35       18.65
       5500 |     61,914        0.28       18.93
       5600 |     61,935        0.28       19.21
       5700 |     58,347        0.27       19.48
       5800 |     67,997        0.31       19.79
       5900 |     72,586        0.33       20.12
       6000 |     73,687        0.33       20.45
       6100 |     58,450        0.27       20.72
       6200 |     64,753        0.29       21.01
       6300 |     63,224        0.29       21.30
       6400 |     58,711        0.27       21.57
       6500 |     66,682        0.30       21.87
       6600 |     75,219        0.34       22.21
       6700 |     64,759        0.29       22.51
       6800 |     57,265        0.26       22.77
       6900 |     68,380        0.31       23.08
       7000 |     62,825        0.29       23.36
       7100 |     69,326        0.31       23.68
       7200 |     64,451        0.29       23.97
       7300 |     61,583        0.28       24.25
       7400 |     75,886        0.34       24.59
       7500 |     58,607        0.27       24.86
       7600 |     60,238        0.27       25.13
       7700 |     45,972        0.21       25.34
       7800 |     66,414        0.30       25.64
       7900 |     73,786        0.34       25.98
       8000 |     51,768        0.24       26.21
       8100 |     62,780        0.29       26.50
       8200 |     60,822        0.28       26.78
       8300 |     68,368        0.31       27.09
       8400 |     65,927        0.30       27.38
       8500 |     65,849        0.30       27.68
       8600 |     64,566        0.29       27.98
       8700 |     69,443        0.32       28.29
       8800 |     69,308        0.31       28.61
       8900 |     66,457        0.30       28.91
       9000 |     63,787        0.29       29.20
       9100 |     56,232        0.26       29.45
       9200 |     60,060        0.27       29.73
       9300 |     54,260        0.25       29.97
       9400 |     68,992        0.31       30.29
       9500 |     66,982        0.30       30.59
       9600 |     76,412        0.35       30.94
       9700 |     69,996        0.32       31.26
       9800 |     53,256        0.24       31.50
       9900 |     62,064        0.28       31.78
      10000 |     67,067        0.30       32.08
      10100 |     68,053        0.31       32.39
      10200 |     56,698        0.26       32.65
      10300 |     58,573        0.27       32.92
      10400 |     58,951        0.27       33.19
      10500 |     74,004        0.34       33.52
      10600 |     50,216        0.23       33.75
      10700 |     57,114        0.26       34.01
      10800 |     82,355        0.37       34.38
      10900 |     71,663        0.33       34.71
      11000 |     64,279        0.29       35.00
      11100 |     64,508        0.29       35.29
      11200 |     70,435        0.32       35.61
      11300 |     66,260        0.30       35.91
      11400 |     55,736        0.25       36.17
      11500 |     75,766        0.34       36.51
      11600 |     65,154        0.30       36.81
      11700 |     64,095        0.29       37.10
      11800 |     75,382        0.34       37.44
      11900 |     63,642        0.29       37.73
      12000 |     84,381        0.38       38.11
      12100 |     69,901        0.32       38.43
      12200 |     61,825        0.28       38.71
      12300 |     70,242        0.32       39.03
      12400 |     73,216        0.33       39.36
      12500 |     57,562        0.26       39.62
      12600 |     65,095        0.30       39.92
      12700 |     58,793        0.27       40.19
      12800 |     82,418        0.37       40.56
      12900 |     64,256        0.29       40.85
      13000 |     63,455        0.29       41.14
      13100 |     55,221        0.25       41.39
      13200 |     68,062        0.31       41.70
      13300 |     61,381        0.28       41.98
      13400 |     73,086        0.33       42.31
      13500 |     67,887        0.31       42.62
      13600 |     56,481        0.26       42.88
      13700 |     66,496        0.30       43.18
      13800 |     63,576        0.29       43.47
      13900 |     73,476        0.33       43.80
      14000 |     76,385        0.35       44.15
      14100 |     70,670        0.32       44.47
      14200 |     75,581        0.34       44.81
      14300 |     76,076        0.35       45.16
      14400 |     68,427        0.31       45.47
      14500 |     60,221        0.27       45.74
      14600 |     58,718        0.27       46.01
      14700 |     63,051        0.29       46.30
      14800 |     56,935        0.26       46.55
      14900 |     65,937        0.30       46.85
      15000 |     66,063        0.30       47.15
      15100 |     56,711        0.26       47.41
      15200 |     72,125        0.33       47.74
      15300 |     68,680        0.31       48.05
      15400 |     69,687        0.32       48.37
      15500 |     79,743        0.36       48.73
      15600 |     59,963        0.27       49.00
      15700 |     70,453        0.32       49.32
      15800 |     73,389        0.33       49.66
      15900 |     60,393        0.27       49.93
      16000 |     66,543        0.30       50.23
      16100 |     66,593        0.30       50.53
      16200 |     66,145        0.30       50.83
      16300 |     75,226        0.34       51.18
      16400 |     70,027        0.32       51.49
      16500 |     70,761        0.32       51.82
      16600 |     58,397        0.27       52.08
      16700 |     65,462        0.30       52.38
      16800 |     73,014        0.33       52.71
      16900 |     73,798        0.34       53.04
      17000 |     62,242        0.28       53.33
      17100 |     74,292        0.34       53.67
      17200 |     57,620        0.26       53.93
      17300 |     80,767        0.37       54.29
      17400 |     80,283        0.36       54.66
      17500 |     71,615        0.33       54.98
      17600 |     63,670        0.29       55.27
      17700 |     67,213        0.31       55.58
      17800 |     65,004        0.30       55.87
      17900 |     69,090        0.31       56.19
      18000 |     71,904        0.33       56.51
      18100 |     76,433        0.35       56.86
      18200 |     67,981        0.31       57.17
      18300 |     70,731        0.32       57.49
      18400 |     71,176        0.32       57.81
      18500 |     83,884        0.38       58.19
      18600 |     84,034        0.38       58.58
      18700 |     66,045        0.30       58.88
      18800 |     85,497        0.39       59.26
      18900 |     68,448        0.31       59.58
      19000 |     71,271        0.32       59.90
      19100 |     72,322        0.33       60.23
      19200 |     60,682        0.28       60.50
      19300 |     59,431        0.27       60.77
      19400 |     89,340        0.41       61.18
      19500 |     73,754        0.33       61.51
      19600 |     63,547        0.29       61.80
      19700 |     66,549        0.30       62.11
      19800 |     65,338        0.30       62.40
      19900 |     60,709        0.28       62.68
      20000 |     66,847        0.30       62.98
      20100 |     72,563        0.33       63.31
      20200 |     65,340        0.30       63.61
      20300 |     77,848        0.35       63.96
      20400 |     63,314        0.29       64.25
      20500 |     69,268        0.31       64.56
      20600 |     62,356        0.28       64.85
      20700 |     64,748        0.29       65.14
      20800 |     67,772        0.31       65.45
      20900 |     58,706        0.27       65.72
      21000 |     71,812        0.33       66.04
      21100 |     63,053        0.29       66.33
      21200 |     66,794        0.30       66.63
      21300 |     68,094        0.31       66.94
      21400 |     75,539        0.34       67.28
      21500 |     66,063        0.30       67.58
      21600 |     52,200        0.24       67.82
      21700 |     71,868        0.33       68.15
      21800 |     73,759        0.34       68.48
      21900 |     65,188        0.30       68.78
      22000 |     67,932        0.31       69.09
      22100 |     60,083        0.27       69.36
      22200 |     61,921        0.28       69.64
      22300 |     66,364        0.30       69.94
      22400 |     64,330        0.29       70.23
      22500 |     65,477        0.30       70.53
      22600 |     69,971        0.32       70.85
      22700 |     64,515        0.29       71.14
      22800 |     63,491        0.29       71.43
      22900 |     78,515        0.36       71.79
      23000 |     53,454        0.24       72.03
      23100 |     70,617        0.32       72.35
      23200 |     73,386        0.33       72.68
      23300 |     75,646        0.34       73.03
      23400 |     70,110        0.32       73.35
      23500 |     78,597        0.36       73.70
      23600 |     70,290        0.32       74.02
      23700 |     67,704        0.31       74.33
      23800 |     65,184        0.30       74.63
      23900 |     61,162        0.28       74.90
      24000 |     75,649        0.34       75.25
      24100 |     59,433        0.27       75.52
      24200 |     76,974        0.35       75.87
      24300 |     73,129        0.33       76.20
      24400 |     68,937        0.31       76.51
      24500 |     66,151        0.30       76.81
      24600 |     47,549        0.22       77.03
      24700 |     64,943        0.29       77.32
      24800 |     73,544        0.33       77.66
      24900 |     68,827        0.31       77.97
      25000 |     58,940        0.27       78.24
      25100 |     58,046        0.26       78.50
      25200 |     69,353        0.31       78.82
      25300 |     73,912        0.34       79.15
      25400 |     63,640        0.29       79.44
      25500 |     68,133        0.31       79.75
      25600 |     59,098        0.27       80.02
      25700 |     63,699        0.29       80.31
      25800 |     48,872        0.22       80.53
      25900 |     69,788        0.32       80.85
      26000 |     72,478        0.33       81.18
      26100 |     66,272        0.30       81.48
      26200 |     58,129        0.26       81.74
      26300 |     61,790        0.28       82.02
      26400 |     76,588        0.35       82.37
      26500 |     51,485        0.23       82.60
      26600 |     65,676        0.30       82.90
      26700 |     75,050        0.34       83.24
      26800 |     60,051        0.27       83.52
      26900 |     79,123        0.36       83.88
      27000 |     53,544        0.24       84.12
      27100 |     82,638        0.38       84.49
      27200 |     57,107        0.26       84.75
      27300 |     67,058        0.30       85.06
      27400 |     58,682        0.27       85.32
      27500 |     56,607        0.26       85.58
      27600 |     59,928        0.27       85.85
      27700 |     59,634        0.27       86.12
      27800 |     81,270        0.37       86.49
      27900 |     66,025        0.30       86.79
      28000 |     63,290        0.29       87.08
      28100 |     57,595        0.26       87.34
      28200 |     66,761        0.30       87.65
      28300 |     57,208        0.26       87.91
      28400 |     71,358        0.32       88.23
      28500 |     64,301        0.29       88.52
      28600 |     71,779        0.33       88.85
      28700 |     49,703        0.23       89.07
      28800 |     71,474        0.32       89.40
      28900 |     50,943        0.23       89.63
      29000 |     72,832        0.33       89.96
      29100 |     64,446        0.29       90.25
      29200 |     60,522        0.27       90.53
      29300 |     69,620        0.32       90.84
      29400 |     68,245        0.31       91.15
      29500 |     68,411        0.31       91.46
      29600 |     62,788        0.29       91.75
      29700 |     52,387        0.24       91.99
      29800 |     63,459        0.29       92.28
      29900 |     50,743        0.23       92.51
      30000 |     52,015        0.24       92.74
      30100 |     40,267        0.18       92.93
      30200 |     60,439        0.27       93.20
      30300 |     63,398        0.29       93.49
      30400 |     63,996        0.29       93.78
      30500 |     50,923        0.23       94.01
      30600 |     64,469        0.29       94.30
      30700 |     70,112        0.32       94.62
      30800 |     57,153        0.26       94.88
      30900 |     47,597        0.22       95.10
      31000 |     59,191        0.27       95.37
      31100 |     68,138        0.31       95.68
      31200 |     69,218        0.31       95.99
      31300 |     71,813        0.33       96.32
      31400 |     56,550        0.26       96.57
      31500 |     54,490        0.25       96.82
      31600 |     67,040        0.30       97.12
      31700 |     65,497        0.30       97.42
      31800 |     53,700        0.24       97.67
      31900 |     57,531        0.26       97.93
      32000 |     48,592        0.22       98.15
      32100 |     56,157        0.26       98.40
      32200 |     53,837        0.24       98.65
      32300 |     57,587        0.26       98.91
      32400 |     57,051        0.26       99.17
      32500 |     42,214        0.19       99.36
      32600 |     50,911        0.23       99.59
      32700 |     47,398        0.22       99.81
      32800 |     42,564        0.19      100.00
------------+-----------------------------------
      Total | 22,017,237      100.00

. 
. * DATA CLEANING==============================================================
> =*/ 
. * minimal data cleaning as want to capture potential discrepancies 
. 
. * IMD 
. replace imd = . if imd <= 0 
(412,627 real changes made, 412,627 to missing)

. 
. /* SENSE CHECKS==============================================================
> ===
> Four main aspects to quality check: 
> 1) Completeness of variables 
> 
> 2) Household size 
> 
> 3) Consistency of household level characteristics across a HHID
> 
> 4) Special considerations when household is care home 
> 
> =============================================================================
> =*/ 
. 
. * 1 COMPLETENESS 
. 
. * Count and drop those with invalid HHID <= 0 
. count
  22,017,237

. drop if household_id <= 0 
(2,920,127 observations deleted)

. count
  19,097,110

. 
. * After dropping those with invalid HHIDs, expect low missingness/issues in o
> ther household level variables 
. 
. * Household Size 
. summarize household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          19,097,110
25%            2              1       Sum of Wgt.    19097110

50%            3                      Mean           5.152498
                        Largest       Std. Dev.      45.49788
75%            4           2588
90%            6           2588       Variance       2070.057
95%            7           2588       Skewness         33.901
99%           13           2588       Kurtosis       1444.456

. gen invalid_household_size =1 if household_size <=0 
(19,097,110 missing values generated)

. tab invalid_household_size, m 

invalid_hou |
sehold_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          . | 19,097,110      100.00      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * IMD 
. tab imd, m 

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
        100 |     51,994        0.27        0.27
        200 |     57,837        0.30        0.58
        300 |     69,472        0.36        0.94
        400 |     57,762        0.30        1.24
        500 |     48,040        0.25        1.49
        600 |     63,943        0.33        1.83
        700 |     63,266        0.33        2.16
        800 |     61,501        0.32        2.48
        900 |     66,585        0.35        2.83
       1000 |     58,256        0.31        3.13
       1100 |     65,194        0.34        3.48
       1200 |     69,101        0.36        3.84
       1300 |     60,438        0.32        4.15
       1400 |     61,725        0.32        4.48
       1500 |     69,728        0.37        4.84
       1600 |     58,495        0.31        5.15
       1700 |     70,324        0.37        5.52
       1800 |     58,704        0.31        5.82
       1900 |     68,599        0.36        6.18
       2000 |     58,938        0.31        6.49
       2100 |     61,087        0.32        6.81
       2200 |     57,411        0.30        7.11
       2300 |     70,352        0.37        7.48
       2400 |     59,445        0.31        7.79
       2500 |     67,622        0.35        8.15
       2600 |     60,970        0.32        8.47
       2700 |     54,079        0.28        8.75
       2800 |     72,792        0.38        9.13
       2900 |     81,770        0.43        9.56
       3000 |     69,851        0.37        9.92
       3100 |     55,263        0.29       10.21
       3200 |     58,414        0.31       10.52
       3300 |     66,180        0.35       10.87
       3400 |     51,706        0.27       11.14
       3500 |     61,814        0.32       11.46
       3600 |     51,946        0.27       11.73
       3700 |     61,573        0.32       12.06
       3800 |     56,480        0.30       12.35
       3900 |     60,329        0.32       12.67
       4000 |     54,482        0.29       12.95
       4100 |     61,053        0.32       13.27
       4200 |     61,725        0.32       13.59
       4300 |     51,383        0.27       13.86
       4400 |     57,388        0.30       14.16
       4500 |     58,764        0.31       14.47
       4600 |     47,589        0.25       14.72
       4700 |     62,152        0.33       15.05
       4800 |     43,806        0.23       15.28
       4900 |     64,441        0.34       15.61
       5000 |     61,496        0.32       15.94
       5100 |     52,800        0.28       16.21
       5200 |     64,899        0.34       16.55
       5300 |     56,768        0.30       16.85
       5400 |     68,547        0.36       17.21
       5500 |     55,702        0.29       17.50
       5600 |     55,055        0.29       17.79
       5700 |     52,015        0.27       18.06
       5800 |     58,297        0.31       18.37
       5900 |     64,517        0.34       18.70
       6000 |     66,327        0.35       19.05
       6100 |     51,287        0.27       19.32
       6200 |     57,880        0.30       19.62
       6300 |     55,817        0.29       19.91
       6400 |     52,273        0.27       20.19
       6500 |     58,584        0.31       20.50
       6600 |     66,972        0.35       20.85
       6700 |     56,498        0.30       21.14
       6800 |     51,110        0.27       21.41
       6900 |     61,794        0.32       21.73
       7000 |     56,891        0.30       22.03
       7100 |     62,556        0.33       22.36
       7200 |     58,340        0.31       22.66
       7300 |     55,254        0.29       22.95
       7400 |     66,616        0.35       23.30
       7500 |     50,575        0.26       23.57
       7600 |     53,292        0.28       23.85
       7700 |     40,921        0.21       24.06
       7800 |     57,314        0.30       24.36
       7900 |     63,720        0.33       24.69
       8000 |     46,328        0.24       24.94
       8100 |     55,330        0.29       25.23
       8200 |     53,485        0.28       25.51
       8300 |     59,408        0.31       25.82
       8400 |     57,734        0.30       26.12
       8500 |     58,689        0.31       26.43
       8600 |     58,595        0.31       26.73
       8700 |     62,245        0.33       27.06
       8800 |     60,760        0.32       27.38
       8900 |     57,548        0.30       27.68
       9000 |     55,541        0.29       27.97
       9100 |     49,123        0.26       28.23
       9200 |     52,415        0.27       28.50
       9300 |     45,612        0.24       28.74
       9400 |     61,106        0.32       29.06
       9500 |     59,614        0.31       29.37
       9600 |     67,899        0.36       29.73
       9700 |     62,483        0.33       30.06
       9800 |     47,453        0.25       30.30
       9900 |     54,466        0.29       30.59
      10000 |     58,984        0.31       30.90
      10100 |     61,171        0.32       31.22
      10200 |     49,035        0.26       31.48
      10300 |     52,096        0.27       31.75
      10400 |     52,015        0.27       32.02
      10500 |     65,104        0.34       32.36
      10600 |     44,265        0.23       32.59
      10700 |     50,848        0.27       32.86
      10800 |     72,495        0.38       33.24
      10900 |     62,128        0.33       33.56
      11000 |     57,450        0.30       33.87
      11100 |     58,179        0.30       34.17
      11200 |     61,444        0.32       34.49
      11300 |     57,681        0.30       34.79
      11400 |     48,791        0.26       35.05
      11500 |     66,321        0.35       35.40
      11600 |     57,165        0.30       35.70
      11700 |     54,253        0.28       35.98
      11800 |     66,876        0.35       36.33
      11900 |     57,177        0.30       36.63
      12000 |     72,899        0.38       37.01
      12100 |     61,619        0.32       37.33
      12200 |     54,560        0.29       37.62
      12300 |     60,639        0.32       37.94
      12400 |     65,553        0.34       38.28
      12500 |     50,643        0.27       38.55
      12600 |     57,093        0.30       38.84
      12700 |     51,167        0.27       39.11
      12800 |     71,832        0.38       39.49
      12900 |     58,483        0.31       39.79
      13000 |     55,362        0.29       40.08
      13100 |     49,389        0.26       40.34
      13200 |     59,413        0.31       40.65
      13300 |     54,858        0.29       40.94
      13400 |     65,472        0.34       41.28
      13500 |     59,632        0.31       41.60
      13600 |     49,303        0.26       41.86
      13700 |     58,193        0.30       42.16
      13800 |     55,254        0.29       42.45
      13900 |     64,398        0.34       42.79
      14000 |     67,372        0.35       43.14
      14100 |     61,455        0.32       43.46
      14200 |     64,843        0.34       43.80
      14300 |     67,800        0.36       44.16
      14400 |     59,756        0.31       44.47
      14500 |     54,132        0.28       44.75
      14600 |     49,573        0.26       45.01
      14700 |     54,675        0.29       45.30
      14800 |     49,803        0.26       45.56
      14900 |     56,538        0.30       45.85
      15000 |     58,390        0.31       46.16
      15100 |     48,703        0.26       46.42
      15200 |     62,696        0.33       46.74
      15300 |     59,763        0.31       47.06
      15400 |     62,413        0.33       47.38
      15500 |     70,460        0.37       47.75
      15600 |     52,542        0.28       48.03
      15700 |     60,861        0.32       48.35
      15800 |     66,671        0.35       48.70
      15900 |     52,295        0.27       48.97
      16000 |     59,507        0.31       49.28
      16100 |     57,718        0.30       49.58
      16200 |     58,363        0.31       49.89
      16300 |     67,033        0.35       50.24
      16400 |     60,981        0.32       50.56
      16500 |     61,118        0.32       50.88
      16600 |     51,319        0.27       51.15
      16700 |     54,922        0.29       51.44
      16800 |     64,047        0.34       51.77
      16900 |     62,226        0.33       52.10
      17000 |     54,203        0.28       52.38
      17100 |     64,393        0.34       52.72
      17200 |     50,773        0.27       52.98
      17300 |     71,112        0.37       53.36
      17400 |     69,554        0.36       53.72
      17500 |     63,358        0.33       54.05
      17600 |     55,869        0.29       54.34
      17700 |     58,730        0.31       54.65
      17800 |     56,703        0.30       54.95
      17900 |     59,235        0.31       55.26
      18000 |     63,081        0.33       55.59
      18100 |     68,180        0.36       55.95
      18200 |     60,182        0.32       56.26
      18300 |     60,518        0.32       56.58
      18400 |     63,149        0.33       56.91
      18500 |     72,657        0.38       57.29
      18600 |     73,031        0.38       57.67
      18700 |     58,623        0.31       57.98
      18800 |     76,917        0.40       58.38
      18900 |     60,241        0.32       58.70
      19000 |     63,772        0.33       59.03
      19100 |     64,142        0.34       59.37
      19200 |     53,320        0.28       59.65
      19300 |     51,653        0.27       59.92
      19400 |     76,602        0.40       60.32
      19500 |     65,284        0.34       60.66
      19600 |     55,919        0.29       60.95
      19700 |     58,989        0.31       61.26
      19800 |     53,797        0.28       61.54
      19900 |     53,491        0.28       61.82
      20000 |     58,169        0.30       62.13
      20100 |     63,597        0.33       62.46
      20200 |     53,665        0.28       62.74
      20300 |     68,042        0.36       63.10
      20400 |     56,355        0.30       63.39
      20500 |     60,737        0.32       63.71
      20600 |     54,691        0.29       64.00
      20700 |     57,022        0.30       64.30
      20800 |     60,478        0.32       64.61
      20900 |     52,039        0.27       64.89
      21000 |     60,379        0.32       65.20
      21100 |     54,905        0.29       65.49
      21200 |     56,552        0.30       65.79
      21300 |     58,468        0.31       66.09
      21400 |     64,809        0.34       66.43
      21500 |     56,488        0.30       66.73
      21600 |     46,044        0.24       66.97
      21700 |     61,359        0.32       67.29
      21800 |     63,789        0.33       67.62
      21900 |     56,932        0.30       67.92
      22000 |     60,703        0.32       68.24
      22100 |     53,624        0.28       68.52
      22200 |     55,524        0.29       68.81
      22300 |     59,286        0.31       69.12
      22400 |     56,866        0.30       69.42
      22500 |     55,428        0.29       69.71
      22600 |     62,075        0.33       70.03
      22700 |     56,454        0.30       70.33
      22800 |     55,125        0.29       70.62
      22900 |     68,923        0.36       70.98
      23000 |     46,486        0.24       71.22
      23100 |     62,776        0.33       71.55
      23200 |     61,832        0.32       71.87
      23300 |     66,320        0.35       72.22
      23400 |     60,416        0.32       72.54
      23500 |     68,034        0.36       72.89
      23600 |     61,346        0.32       73.22
      23700 |     58,845        0.31       73.52
      23800 |     56,842        0.30       73.82
      23900 |     53,108        0.28       74.10
      24000 |     67,970        0.36       74.46
      24100 |     49,813        0.26       74.72
      24200 |     67,315        0.35       75.07
      24300 |     63,463        0.33       75.40
      24400 |     60,477        0.32       75.72
      24500 |     58,238        0.30       76.02
      24600 |     42,217        0.22       76.24
      24700 |     56,216        0.29       76.54
      24800 |     63,705        0.33       76.87
      24900 |     58,780        0.31       77.18
      25000 |     52,095        0.27       77.45
      25100 |     50,210        0.26       77.72
      25200 |     60,472        0.32       78.03
      25300 |     64,282        0.34       78.37
      25400 |     54,298        0.28       78.65
      25500 |     59,294        0.31       78.96
      25600 |     51,209        0.27       79.23
      25700 |     55,267        0.29       79.52
      25800 |     41,621        0.22       79.74
      25900 |     60,097        0.31       80.05
      26000 |     61,969        0.32       80.38
      26100 |     56,454        0.30       80.67
      26200 |     49,897        0.26       80.94
      26300 |     55,207        0.29       81.22
      26400 |     65,465        0.34       81.57
      26500 |     45,191        0.24       81.80
      26600 |     56,075        0.29       82.10
      26700 |     65,968        0.35       82.44
      26800 |     53,272        0.28       82.72
      26900 |     67,135        0.35       83.07
      27000 |     45,638        0.24       83.31
      27100 |     69,384        0.36       83.68
      27200 |     47,930        0.25       83.93
      27300 |     57,360        0.30       84.23
      27400 |     52,299        0.27       84.50
      27500 |     48,500        0.25       84.75
      27600 |     53,018        0.28       85.03
      27700 |     52,503        0.27       85.31
      27800 |     72,243        0.38       85.69
      27900 |     57,010        0.30       85.98
      28000 |     53,482        0.28       86.26
      28100 |     49,810        0.26       86.53
      28200 |     57,905        0.30       86.83
      28300 |     48,526        0.25       87.08
      28400 |     62,025        0.32       87.41
      28500 |     54,860        0.29       87.69
      28600 |     63,105        0.33       88.02
      28700 |     42,637        0.22       88.25
      28800 |     59,678        0.31       88.56
      28900 |     41,417        0.22       88.78
      29000 |     62,449        0.33       89.10
      29100 |     54,060        0.28       89.39
      29200 |     51,139        0.27       89.66
      29300 |     57,467        0.30       89.96
      29400 |     59,285        0.31       90.27
      29500 |     58,581        0.31       90.57
      29600 |     53,677        0.28       90.85
      29700 |     44,613        0.23       91.09
      29800 |     55,388        0.29       91.38
      29900 |     44,362        0.23       91.61
      30000 |     43,767        0.23       91.84
      30100 |     34,283        0.18       92.02
      30200 |     50,889        0.27       92.29
      30300 |     54,189        0.28       92.57
      30400 |     55,217        0.29       92.86
      30500 |     41,920        0.22       93.08
      30600 |     53,193        0.28       93.36
      30700 |     59,115        0.31       93.67
      30800 |     48,793        0.26       93.92
      30900 |     41,647        0.22       94.14
      31000 |     51,022        0.27       94.41
      31100 |     59,054        0.31       94.72
      31200 |     58,852        0.31       95.02
      31300 |     60,988        0.32       95.34
      31400 |     47,424        0.25       95.59
      31500 |     47,147        0.25       95.84
      31600 |     57,084        0.30       96.14
      31700 |     55,042        0.29       96.43
      31800 |     45,986        0.24       96.67
      31900 |     48,041        0.25       96.92
      32000 |     41,324        0.22       97.13
      32100 |     47,075        0.25       97.38
      32200 |     45,245        0.24       97.62
      32300 |     49,472        0.26       97.88
      32400 |     48,721        0.26       98.13
      32500 |     35,159        0.18       98.32
      32600 |     43,605        0.23       98.54
      32700 |     40,601        0.21       98.76
      32800 |     36,684        0.19       98.95
          . |    200,602        1.05      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * Rural Urban
. tab rural_urban, m 

rural_urban |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |    178,375        0.93        0.93
          0 |        145        0.00        0.93
          1 |  3,939,334       20.63       21.56
          2 |  1,194,912        6.26       27.82
          3 |  9,863,484       51.65       79.47
          4 |     30,602        0.16       79.63
          5 |  2,103,533       11.01       90.64
          6 |     90,295        0.47       91.12
          7 |  1,576,308        8.25       99.37
          8 |    120,122        0.63      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * Care Home Status 
. tab care_home_type, m 

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
            |        145        0.00        0.00
         PC |     41,140        0.22        0.22
         PN |     33,573        0.18        0.39
         PS |      1,822        0.01        0.40
          U | 19,020,430       99.60      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * Percent TPP 
. summarize percent_tpp, d 

                         percent_tpp
-------------------------------------------------------------
      Percentiles      Smallest
 1%           25              0
 5%           62              0
10%           80              0       Obs          19,097,110
25%          100              0       Sum of Wgt.    19097110

50%          100                      Mean           94.99685
                        Largest       Std. Dev.      14.59171
75%          100            100
90%          100            100       Variance        212.918
95%          100            100       Skewness      -3.396726
99%          100            100       Kurtosis       14.99898

. gen invalid_percent_tpp=1 if percent_tpp <= 0 
(19,085,689 missing values generated)

. tab invalid_percent_tpp, m 

invalid_per |
   cent_tpp |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     11,421        0.06        0.06
          . | 19,085,689       99.94      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * Individuals may have 0 TPP percent validly because of rounding errors in ca
> lculation 
. 
. * Mixed household 
. tab mixed_household, m 

mixed_house |
       hold |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16,405,310       85.90       85.90
          1 |  2,691,800       14.10      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * 2 HOUSEHOLD SIZE 
. * Describing this just overall, but note means etc will be higher because mor
> e people will live in a large household 
. * This is just to get a sense for the variables 
. 
. * Recalculate household size 
. bysort household_id: egen size_check = count(patient_id)

. 
. * Cross check household size 
. summarize household_size 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
household_~e | 19,097,110    5.152498    45.49788          1       2588

. summarize size_check 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  size_check | 19,097,110    4.588919    35.37578          1       1946

. 
. gen discrepant_size = (household_size != size_check)

. 
. tab discrepant_size, m

discrepant_ |
       size |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 17,448,660       91.37       91.37
          1 |  1,648,450        8.63      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * household size keeping one row per household 
. preserve 

. duplicates drop household_id, force 

Duplicates in terms of household_id

(10,388,714 observations deleted)

. 
. * Overall 
. summarize household_size , d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs           8,708,396
25%            1              1       Sum of Wgt.   8,708,396

50%            2                      Mean           2.292671
                        Largest       Std. Dev.      2.809522
75%            3           1221
90%            4           1486       Variance       7.893413
95%            5           1561       Skewness       268.0488
99%            7           2588       Kurtosis       147558.8

. summarize size_check, d 

                         size_check
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs           8,708,396
25%            1              1       Sum of Wgt.   8,708,396

50%            2                      Mean           2.192954
                        Largest       Std. Dev.      2.292213
75%            3           1097
90%            4           1207       Variance       5.254241
95%            5           1246       Skewness        227.953
99%            7           1946       Kurtosis       117908.4

. 
. restore 

. 
. * 3 CONSISTENCY 
. * Are variables such as size consistent across a household? 
. * code from https://www.stata.com/support/faqs/data-management/listing-observ
> ations-in-group/ 
. 
. * Size 
. sort household_id household_size 

. by household_id (household_size), sort: gen not_consistent_hhsize = household
> _size[1] != household_size[_N]

. 
. tab not_consistent_hhsize, m 

not_consist |
 ent_hhsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 19,097,110      100.00      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. ** if discrepant, how discrepant 
. sort household_id household_size 

. by household_id (household_size), sort: gen discrepancy_hhsize = abs(househol
> d_size[1] - household_size[_N]) 

. 
. summarize discrepancy_hhsize 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
discrepanc~e | 19,097,110           0           0          0          0

. 
. * Care Home Status 
. sort household_id care_home_type 

. by household_id (care_home_type), sort: gen not_consistent_chstatus = care_ho
> me_type[1] != care_home_type[_N]

. 
. tab not_consistent_chstatus, m 

not_consist |
ent_chstatu |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 19,053,141       99.77       99.77
          1 |     43,969        0.23      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. 
. * 4 CARE HOMES 
. 
. * Household size in care homes (multiple patients)
. bysort care_home_type: summarize household_size, d 

-------------------------------------------------------------------------------
-> care_home_type = 

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 145
25%            2              1       Sum of Wgt.         145

50%            3                      Mean           3.868966
                        Largest       Std. Dev.      3.186898
75%            5              9
90%            7             11       Variance       10.15632
95%            9             14       Skewness        3.85557
99%           14             29       Kurtosis       28.50115

-------------------------------------------------------------------------------
-> care_home_type = PC

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              41,140
25%            7              1       Sum of Wgt.      41,140

50%           17                      Mean           23.86176
                        Largest       Std. Dev.      48.20163
75%           29            553
90%           42            553       Variance       2323.398
95%           53            553       Skewness       9.665906
99%           89            553       Kurtosis       105.9569

-------------------------------------------------------------------------------
-> care_home_type = PN

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs              33,573
25%           10              1       Sum of Wgt.      33,573

50%           23                      Mean           26.14452
                        Largest       Std. Dev.      19.94567
75%           38            133
90%           53            133       Variance       397.8296
95%           62            133       Skewness        .986373
99%           91            133       Kurtosis       4.273528

-------------------------------------------------------------------------------
-> care_home_type = PS

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            4              1       Obs               1,822
25%           16              1       Sum of Wgt.       1,822

50%           26                      Mean            30.9506
                        Largest       Std. Dev.      21.18548
75%           45             81
90%           60             81       Variance       448.8246
95%           66             81       Skewness       .5084291
99%           81             81       Kurtosis        2.34408

-------------------------------------------------------------------------------
-> care_home_type = U

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          19,020,430
25%            2              1       Sum of Wgt.    19020430

50%            3                      Mean           5.072516
                        Largest       Std. Dev.      45.50853
75%            4           2588
90%            5           2588       Variance       2071.027
95%            7           2588       Skewness       33.99021
99%           11           2588       Kurtosis       1448.828


. 
. * household size keeping one row per household 
. preserve 

. duplicates drop household_id, force 

Duplicates in terms of household_id

(10,388,714 observations deleted)

. 
. * By care home type 
. bysort care_home_type: summarize household_size, d 

-------------------------------------------------------------------------------
-> care_home_type = 

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 111
25%            2              1       Sum of Wgt.         111

50%            3                      Mean           3.621622
                        Largest       Std. Dev.      3.416681
75%            4              9
90%            7             11       Variance       11.67371
95%            9             14       Skewness        4.18164
99%           14             29       Kurtosis       29.27993

-------------------------------------------------------------------------------
-> care_home_type = PC

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               9,095
25%            1              1       Sum of Wgt.       9,095

50%            2                      Mean           7.096427
                        Largest       Std. Dev.      11.61205
75%            9             83
90%           20             89       Variance       134.8397
95%           28            101       Skewness        13.1291
99%           46            553       Kurtosis        543.858

-------------------------------------------------------------------------------
-> care_home_type = PN

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               5,902
25%            1              1       Sum of Wgt.       5,902

50%            2                      Mean           8.321416
                        Largest       Std. Dev.      12.65007
75%           10            104
90%           26            105       Variance       160.0243
95%           36            106       Skewness       2.596706
99%           56            133       Kurtosis       11.71136

-------------------------------------------------------------------------------
-> care_home_type = PS

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 251
25%            1              1       Sum of Wgt.         251

50%            3                      Mean           10.09562
                        Largest       Std. Dev.      14.77264
75%           14             60
90%           29             66       Variance       218.2308
95%           42             75       Skewness       2.176389
99%           66             81       Kurtosis       7.926494

-------------------------------------------------------------------------------
-> care_home_type = U

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs           8,693,037
25%            1              1       Sum of Wgt.   8,693,037

50%            2                      Mean           2.283309
                        Largest       Std. Dev.      2.756912
75%            3           1221
90%            4           1486       Variance       7.600561
95%            5           1561       Skewness       282.7832
99%            7           2588       Kurtosis       159241.5


. 
. restore 

. 
. * Care home residents in household with >3 people > 65 (replicating short dat
> a report)
. 
. tab care_home_type, m 

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
            |        145        0.00        0.00
         PC |     41,140        0.22        0.22
         PN |     33,573        0.18        0.39
         PS |      1,822        0.01        0.40
          U | 19,020,430       99.60      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. gen old = (age >= 65) 

. 
. bysort household_id: egen care_home_check = total(old)

. 
. gen household_care_home = (care_home_check >= 3)

. 
. * overlap with care home linkage 
. 
. gen care_home = 1 if care_home_type == "PC" 
(19,055,970 missing values generated)

. replace care_home = 1 if care_home_type == "PN"
(33,573 real changes made)

. replace care_home = 1 if care_home_type == "PS"
(1,822 real changes made)

. replace care_home = 0 if care_home == . 
(19,020,575 real changes made)

. 
. tab care_home 

  care_home |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 19,020,575       99.60       99.60
          1 |     76,535        0.40      100.00
------------+-----------------------------------
      Total | 19,097,110      100.00

. tab care_home care_home_type 

           |               care_home_type
 care_home |        PC         PN         PS          U |     Total
-----------+--------------------------------------------+----------
         0 |         0          0          0 19,020,430 |19,020,430 
         1 |    41,140     33,573      1,822          0 |    76,535 
-----------+--------------------------------------------+----------
     Total |    41,140     33,573      1,822 19,020,430 |19,096,965 

. 
. tab care_home household_care_home 

           |  household_care_home
 care_home |         0          1 |     Total
-----------+----------------------+----------
         0 |18,951,989     68,586 |19,020,575 
         1 |    12,337     64,198 |    76,535 
-----------+----------------------+----------
     Total |18,964,326    132,784 |19,097,110 

. 
. * Close log 
. log close 
      name:  <unnamed>
       log:  /workspace/output/statalogs/repeat_checks_hhid.log
  log type:  text
 closed on:  19 Jul 2021, 17:08:57
-------------------------------------------------------------------------------
